tests/artillery/artillerySklepTest.yml
config:
  target: https://skleptest.pl/
  payload:
    - path: ./pages.csv
      fields: ['url']
  # Test phases
  phases:
    - arrivalRate: 1
      duration: 10
  # Enable the Playwright engine:
  engines:
    playwright: { aggregateByName: true }
  processor: './sklepTest.ts'
scenarios:
  - name: Test Sklep
    engine: playwright
    # flowFunction: "testSklep"
    flowFunction: 'checkPage'
    flow: []